In [1]:
import numpy as np
import pandas as pd

In [2]:
a = pd.Series([1, 2, 3, 4])
a

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
print(a+1)
print(a-1)
print(a*2)
print(a/2)
print(a//2)
print(a%2)
print(a**2)
print(2**a)

0    2
1    3
2    4
3    5
dtype: int64
0    0
1    1
2    2
3    3
dtype: int64
0    2
1    4
2    6
3    8
dtype: int64
0    0.5
1    1.0
2    1.5
3    2.0
dtype: float64
0    0
1    1
2    1
3    2
dtype: int64
0    1
1    0
2    1
3    0
dtype: int64
0     1
1     4
2     9
3    16
dtype: int64
0     2
1     4
2     8
3    16
dtype: int64

In [4]:
b = pd.Series([30, 20, 10, 40], index=['c', 'b', 'a', 'd'])
b

c    30
b    20
a    10
d    40
dtype: int64

In [5]:
a+b

0   NaN
1   NaN
2   NaN
3   NaN
a   NaN
b   NaN
c   NaN
d   NaN
dtype: float64

In [6]:
data1 = {'Seoul':4000, 'Busan':2000, 'Incheon':1500, 'Gwangju':1000}
cities = ['Seoul','Daegu','Incheon','Gwangju']

c = pd.Series(data1)
d = pd.Series(data1, index=cities)

print(c)
print(d)

Seoul      4000
Busan      2000
Incheon    1500
Gwangju    1000
dtype: int64
Seoul      4000.0
Daegu         NaN
Incheon    1500.0
Gwangju    1000.0
dtype: float64

In [7]:
print(c+d)
print(c-d)
print(c*d)
print(c/d)
print(c//d)
print(c%d)
print(c**d)

Busan         NaN
Daegu         NaN
Gwangju    2000.0
Incheon    3000.0
Seoul      8000.0
dtype: float64
Busan      NaN
Daegu      NaN
Gwangju    0.0
Incheon    0.0
Seoul      0.0
dtype: float64
Busan             NaN
Daegu             NaN
Gwangju     1000000.0
Incheon     2250000.0
Seoul      16000000.0
dtype: float64
Busan      NaN
Daegu      NaN
Gwangju    1.0
Incheon    1.0
Seoul      1.0
dtype: float64
Busan      NaN
Daegu      NaN
Gwangju    1.0
Incheon    1.0
Seoul      1.0
dtype: float64
Busan      NaN
Daegu      NaN
Gwangju    0.0
Incheon    0.0
Seoul      0.0
dtype: float64
Busan      NaN
Daegu      NaN
Gwangju    inf
Incheon    inf
Seoul      inf
dtype: float64

In [9]:
x = pd.DataFrame(np.arange(12).reshape(3, 4),
                columns = list('abcd'))
x

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [10]:
x+1

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [11]:
x-1

   a  b  c   d
0 -1  0  1   2
1  3  4  5   6
2  7  8  9  10

In [12]:
x*2

    a   b   c   d
0   0   2   4   6
1   8  10  12  14
2  16  18  20  22

In [13]:
x/2

     a    b    c    d
0  0.0  0.5  1.0  1.5
1  2.0  2.5  3.0  3.5
2  4.0  4.5  5.0  5.5

In [14]:
x//2

   a  b  c  d
0  0  0  1  1
1  2  2  3  3
2  4  4  5  5

In [15]:
x%2

   a  b  c  d
0  0  1  0  1
1  0  1  0  1
2  0  1  0  1

In [18]:
x**2

    a   b    c    d
0   0   1    4    9
1  16  25   36   49
2  64  81  100  121

In [19]:
2**x

     a    b     c     d
0    1    2     4     8
1   16   32    64   128
2  256  512  1024  2048

In [20]:
y = pd.DataFrame(np.arange(20).reshape(4, 5),
                columns=list('abcde'))
y

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [21]:
x+y

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [22]:
x-y

     a    b    c    d   e
0  0.0  0.0  0.0  0.0 NaN
1 -1.0 -1.0 -1.0 -1.0 NaN
2 -2.0 -2.0 -2.0 -2.0 NaN
3  NaN  NaN  NaN  NaN NaN

In [23]:
x*y

      a     b      c      d   e
0   0.0   1.0    4.0    9.0 NaN
1  20.0  30.0   42.0   56.0 NaN
2  80.0  99.0  120.0  143.0 NaN
3   NaN   NaN    NaN    NaN NaN

In [24]:
x/y

     a         b         c         d   e
0  NaN  1.000000  1.000000  1.000000 NaN
1  0.8  0.833333  0.857143  0.875000 NaN
2  0.8  0.818182  0.833333  0.846154 NaN
3  NaN       NaN       NaN       NaN NaN

In [25]:
x//y

     a    b    c    d   e
0  NaN  1.0  1.0  1.0 NaN
1  0.0  0.0  0.0  0.0 NaN
2  0.0  0.0  0.0  0.0 NaN
3  NaN  NaN  NaN  NaN NaN

In [26]:
x%y

     a    b     c     d   e
0  NaN  0.0   0.0   0.0 NaN
1  4.0  5.0   6.0   7.0 NaN
2  8.0  9.0  10.0  11.0 NaN
3  NaN  NaN   NaN   NaN NaN

In [27]:
x**y

              a             b             c             d   e
0  1.000000e+00  1.000000e+00  4.000000e+00  2.700000e+01 NaN
1  1.024000e+03  1.562500e+04  2.799360e+05  5.764801e+06 NaN
2  1.073742e+09  3.138106e+10  1.000000e+12  3.452271e+13 NaN
3           NaN           NaN           NaN           NaN NaN

In [28]:
df = pd.DataFrame(np.arange(12).reshape(4, 3),
                  columns=list('bde'),
                  index=['seoul', 'busan', 'incheon', 'suwon'])
df

         b   d   e
seoul    0   1   2
busan    3   4   5
incheon  6   7   8
suwon    9  10  11

In [29]:
s = df.iloc[0]
s

b    0
d    1
e    2
Name: seoul, dtype: int64

In [30]:
df-s

         b  d  e
seoul    0  0  0
busan    3  3  3
incheon  6  6  6
suwon    9  9  9

In [31]:
s2 = pd.Series(range(3), index=list('bef'))
s2

b    0
e    1
f    2
dtype: int64

In [32]:
df+s2

           b   d     e   f
seoul    0.0 NaN   3.0 NaN
busan    3.0 NaN   6.0 NaN
incheon  6.0 NaN   9.0 NaN
suwon    9.0 NaN  12.0 NaN

In [33]:
s3 = df['d']
s3

seoul       1
busan       4
incheon     7
suwon      10
Name: d, dtype: int64

In [34]:
s3 = df['d']
df+s3

          b  busan   d   e  incheon  seoul  suwon
seoul   NaN    NaN NaN NaN      NaN    NaN    NaN
busan   NaN    NaN NaN NaN      NaN    NaN    NaN
incheon NaN    NaN NaN NaN      NaN    NaN    NaN
suwon   NaN    NaN NaN NaN      NaN    NaN    NaN

In [35]:
df-s3

          b  busan   d   e  incheon  seoul  suwon
seoul   NaN    NaN NaN NaN      NaN    NaN    NaN
busan   NaN    NaN NaN NaN      NaN    NaN    NaN
incheon NaN    NaN NaN NaN      NaN    NaN    NaN
suwon   NaN    NaN NaN NaN      NaN    NaN    NaN

In [36]:
print(x)
print(y)

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11
    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [37]:
z = np.array([-1, 2.37, 3.56, -4.92, 5.61, 6, -1.25, 4, 5]).reshape(3, 3)
z = pd.DataFrame(z, columns=list('abf'))
z

      a     b     f
0 -1.00  2.37  3.56
1 -4.92  5.61  6.00
2 -1.25  4.00  5.00

In [38]:
x.add(y)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [39]:
x2 = x.copy()
x2 = x2.reindex(columns=y.columns, fill_value=0)
x2.loc[3, :] = [0, 0, 0, 0, 0]
x2

     a    b     c     d    e
0  0.0  1.0   2.0   3.0  0.0
1  4.0  5.0   6.0   7.0  0.0
2  8.0  9.0  10.0  11.0  0.0
3  0.0  0.0   0.0   0.0  0.0

In [40]:
x2.add(y)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [41]:
x.add(y, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [42]:
x.add(y, fill_value=2)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   6.0
1   9.0  11.0  13.0  15.0  11.0
2  18.0  20.0  22.0  24.0  16.0
3  17.0  18.0  19.0  20.0  21.0

In [43]:
df.add(s3, axis=0)

          b   d   e
seoul     1   2   3
busan     7   8   9
incheon  13  14  15
suwon    19  20  21

In [44]:
df.sub(s3, axis=0)

         b  d  e
seoul   -1  0  1
busan   -1  0  1
incheon -1  0  1
suwon   -1  0  1

In [45]:
x.sub(y)

     a    b    c    d   e
0  0.0  0.0  0.0  0.0 NaN
1 -1.0 -1.0 -1.0 -1.0 NaN
2 -2.0 -2.0 -2.0 -2.0 NaN
3  NaN  NaN  NaN  NaN NaN

In [46]:
x.diff()

     a    b    c    d
0  NaN  NaN  NaN  NaN
1  4.0  4.0  4.0  4.0
2  4.0  4.0  4.0  4.0

In [47]:
x.diff(axis=0)

     a    b    c    d
0  NaN  NaN  NaN  NaN
1  4.0  4.0  4.0  4.0
2  4.0  4.0  4.0  4.0

In [48]:
x.diff(axis=1)

    a    b    c    d
0 NaN  1.0  1.0  1.0
1 NaN  1.0  1.0  1.0
2 NaN  1.0  1.0  1.0

In [49]:
x.mul(y)

      a     b      c      d   e
0   0.0   1.0    4.0    9.0 NaN
1  20.0  30.0   42.0   56.0 NaN
2  80.0  99.0  120.0  143.0 NaN
3   NaN   NaN    NaN    NaN NaN

In [50]:
x.prod()

a      0
b     45
c    120
d    231
dtype: int64

In [51]:
x.prod(axis=0)

a      0
b     45
c    120
d    231
dtype: int64

In [52]:
x.prod(axis=1)

0       0
1     840
2    7920
dtype: int64

In [53]:
x.div(y)

     a         b         c         d   e
0  NaN  1.000000  1.000000  1.000000 NaN
1  0.8  0.833333  0.857143  0.875000 NaN
2  0.8  0.818182  0.833333  0.846154 NaN
3  NaN       NaN       NaN       NaN NaN

In [54]:
x.pow(y)

              a             b             c             d   e
0  1.000000e+00  1.000000e+00  4.000000e+00  2.700000e+01 NaN
1  1.024000e+03  1.562500e+04  2.799360e+05  5.764801e+06 NaN
2  1.073742e+09  3.138106e+10  1.000000e+12  3.452271e+13 NaN
3           NaN           NaN           NaN           NaN NaN

In [55]:
x.mod(y)

     a    b     c     d   e
0  NaN  0.0   0.0   0.0 NaN
1  4.0  5.0   6.0   7.0 NaN
2  8.0  9.0  10.0  11.0 NaN
3  NaN  NaN   NaN   NaN NaN

In [57]:
z.abs()

      a     b     f
0  1.00  2.37  3.56
1  4.92  5.61  6.00
2  1.25  4.00  5.00

In [58]:
np.add(x, y)

ValueError: operands could not be broadcast together with shapes (3,4) (4,5)

In [59]:
w = y.copy()
w = w.drop(3)
del w['e']

print(y)
print(w)

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
    a   b   c   d
0   0   1   2   3
1   5   6   7   8
2  10  11  12  13

In [60]:
np.add(x, w)

    a   b   c   d
0   0   2   4   6
1   9  11  13  15
2  18  20  22  24

In [61]:
np.subtract(x, w)

   a  b  c  d
0  0  0  0  0
1 -1 -1 -1 -1
2 -2 -2 -2 -2

In [62]:
np.multiply(x, w)

    a   b    c    d
0   0   1    4    9
1  20  30   42   56
2  80  99  120  143

In [63]:
np.divide(x, w)

<ipython-input-63-5c5c927cbb06>:1: RuntimeWarning: invalid value encountered in true_divide
  np.divide(x, w)

     a         b         c         d
0  NaN  1.000000  1.000000  1.000000
1  0.8  0.833333  0.857143  0.875000
2  0.8  0.818182  0.833333  0.846154

In [64]:
np.power(x, w)

            a            b              c               d
0           1            1              4              27
1        1024        15625         279936         5764801
2  1073741824  31381059609  1000000000000  34522712143931

In [65]:
print(np.modf(z))

(      a     b     f
0 -0.00  0.37  0.56
1 -0.92  0.61  0.00
2 -0.25  0.00  0.00,      a    b    f
0 -1.0  2.0  3.0
1 -4.0  5.0  6.0
2 -1.0  4.0  5.0)

In [66]:
print(np.modf(z)[0])
print(np.modf(z)[1])

      a     b     f
0 -0.00  0.37  0.56
1 -0.92  0.61  0.00
2 -0.25  0.00  0.00
     a    b    f
0 -1.0  2.0  3.0
1 -4.0  5.0  6.0
2 -1.0  4.0  5.0

In [67]:
np.fabs(z)

      a     b     f
0  1.00  2.37  3.56
1  4.92  5.61  6.00
2  1.25  4.00  5.00

In [68]:
np.sqrt(x)

          a         b         c         d
0  0.000000  1.000000  1.414214  1.732051
1  2.000000  2.236068  2.449490  2.645751
2  2.828427  3.000000  3.162278  3.316625

In [69]:
np.square(x)

    a   b    c    d
0   0   1    4    9
1  16  25   36   49
2  64  81  100  121

In [70]:
np.exp(x)

             a            b             c             d
0     1.000000     2.718282      7.389056     20.085537
1    54.598150   148.413159    403.428793   1096.633158
2  2980.957987  8103.083928  22026.465795  59874.141715

In [71]:
np.log(x)

<ipython-input-71-de666c833898>:1: RuntimeWarning: divide by zero encountered in log
  np.log(x)

          a         b         c         d
0      -inf  0.000000  0.693147  1.098612
1  1.386294  1.609438  1.791759  1.945910
2  2.079442  2.197225  2.302585  2.397895

In [72]:
np.log1p(x)

          a         b         c         d
0  0.000000  0.693147  1.098612  1.386294
1  1.609438  1.791759  1.945910  2.079442
2  2.197225  2.302585  2.397895  2.484907

In [73]:
np.maximum(x, w)

    a   b   c   d
0   0   1   2   3
1   5   6   7   8
2  10  11  12  13

In [74]:
np.minimum(x, w)

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [75]:
np.gradient(x)

[array([[4., 4., 4., 4.],
        [4., 4., 4., 4.],
        [4., 4., 4., 4.]]),
 array([[1., 1., 1., 1.],
        [1., 1., 1., 1.],
        [1., 1., 1., 1.]])]

In [76]:
np.gradient(x, axis=0)

array([[4., 4., 4., 4.],
       [4., 4., 4., 4.],
       [4., 4., 4., 4.]])

In [77]:
np.gradient(x, axis=1)

array([[1., 1., 1., 1.],
       [1., 1., 1., 1.],
       [1., 1., 1., 1.]])

In [78]:
np.ceil(z)

     a    b    f
0 -1.0  3.0  4.0
1 -4.0  6.0  6.0
2 -1.0  4.0  5.0

In [79]:
np.floor(z)

     a    b    f
0 -1.0  2.0  3.0
1 -5.0  5.0  6.0
2 -2.0  4.0  5.0

In [80]:
np.rint(z)

     a    b    f
0 -1.0  2.0  4.0
1 -5.0  6.0  6.0
2 -1.0  4.0  5.0

In [81]:
np.around(z)

     a    b    f
0 -1.0  2.0  4.0
1 -5.0  6.0  6.0
2 -1.0  4.0  5.0

In [82]:
np.round_(z, 1)

     a    b    f
0 -1.0  2.4  3.6
1 -4.9  5.6  6.0
2 -1.2  4.0  5.0

In [83]:
np.fix(z)

array([[-1.,  2.,  3.],
       [-4.,  5.,  6.],
       [-1.,  4.,  5.]])

In [84]:
np.trunc(z)

     a    b    f
0 -1.0  2.0  3.0
1 -4.0  5.0  6.0
2 -1.0  4.0  5.0

In [87]:
print(np.cos(x))
print(np.cosh(x))
print(np.sin(x))
print(np.sinh(x))
print(np.tan(x))
print(np.tanh(x))

          a         b         c         d
0  1.000000  0.540302 -0.416147 -0.989992
1 -0.653644  0.283662  0.960170  0.753902
2 -0.145500 -0.911130 -0.839072  0.004426
             a            b             c             d
0     1.000000     1.543081      3.762196     10.067662
1    27.308233    74.209949    201.715636    548.317035
2  1490.479161  4051.542025  11013.232920  29937.070866
          a         b         c         d
0  0.000000  0.841471  0.909297  0.141120
1 -0.756802 -0.958924 -0.279415  0.656987
2  0.989358  0.412118 -0.544021 -0.999990
             a            b             c             d
0     0.000000     1.175201      3.626860     10.017875
1    27.289917    74.203211    201.713157    548.316123
2  1490.478826  4051.541902  11013.232875  29937.070849
          a         b         c           d
0  0.000000  1.557408 -2.185040   -0.142547
1  1.157821 -3.380515 -0.291006    0.871448
2 -6.799711 -0.452316  0.648361 -225.950846
          a         b         c         d
0  0.000000  0.761594  0.964028  0.995055
1  0.999329  0.999909  0.999988  0.999998
2  1.000000  1.000000  1.000000  1.000000

In [88]:
print(np.arccos(x))
print(np.arccosh(x))
print(np.arcsin(x))
print(np.arcsinh(x))
print(np.arctan(x))
print(np.arctanh(x))

          a    b   c   d
0  1.570796  0.0 NaN NaN
1       NaN  NaN NaN NaN
2       NaN  NaN NaN NaN
          a         b         c         d
0       NaN  0.000000  1.316958  1.762747
1  2.063437  2.292432  2.477889  2.633916
2  2.768659  2.887271  2.993223  3.088970
     a         b   c   d
0  0.0  1.570796 NaN NaN
1  NaN       NaN NaN NaN
2  NaN       NaN NaN NaN
          a         b         c         d
0  0.000000  0.881374  1.443635  1.818446
1  2.094713  2.312438  2.491780  2.644121
2  2.776472  2.893444  2.998223  3.093102
          a         b         c         d
0  0.000000  0.785398  1.107149  1.249046
1  1.325818  1.373401  1.405648  1.428899
2  1.446441  1.460139  1.471128  1.480136
     a    b   c   d
0  0.0  inf NaN NaN
1  NaN  NaN NaN NaN
2  NaN  NaN NaN NaN

<ipython-input-88-c0dec5d81dce>:1: RuntimeWarning: invalid value encountered in arccos
  print(np.arccos(x))
<ipython-input-88-c0dec5d81dce>:2: RuntimeWarning: invalid value encountered in arccosh
  print(np.arccosh(x))
<ipython-input-88-c0dec5d81dce>:3: RuntimeWarning: invalid value encountered in arcsin
  print(np.arcsin(x))
<ipython-input-88-c0dec5d81dce>:6: RuntimeWarning: divide by zero encountered in arctanh
  print(np.arctanh(x))
<ipython-input-88-c0dec5d81dce>:6: RuntimeWarning: invalid value encountered in arctanh
  print(np.arctanh(x))

In [89]:
print(np.deg2rad(x))
print(np.rad2deg(x))

          a         b         c         d
0  0.000000  0.017453  0.034907  0.052360
1  0.069813  0.087266  0.104720  0.122173
2  0.139626  0.157080  0.174533  0.191986
            a           b           c           d
0    0.000000   57.295780  114.591559  171.887339
1  229.183118  286.478898  343.774677  401.070457
2  458.366236  515.662016  572.957795  630.253575

In [90]:
data = [[1.4, np.nan],
       [7.1, -4.5],
       [np.nan, np.nan],
       [0.75, -1.31]]
data = pd.DataFrame(data, columns=['one', 'two'], index=['a', 'b', 'c', 'd'])
data

    one   two
a  1.40   NaN
b  7.10 -4.50
c   NaN   NaN
d  0.75 -1.31

In [91]:
data.sum()

one    9.25
two   -5.81
dtype: float64

In [92]:
data.sum(axis=0)

one    9.25
two   -5.81
dtype: float64

In [93]:
data.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.56
dtype: float64

In [94]:
data.sum(axis=0, skipna=False)

one   NaN
two   NaN
dtype: float64

In [95]:
data.sum(axis=1, skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.56
dtype: float64

In [98]:
data['one'].sum()

9.25

In [99]:
data.loc['b'].sum()

2.5999999999999996

In [100]:
data.count()

one    3
two    2
dtype: int64

In [101]:
data.mean()

one    3.083333
two   -2.905000
dtype: float64

In [102]:
data.median()

one    1.400
two   -2.905
dtype: float64

In [103]:
data.mad()

one    2.677778
two    1.595000
dtype: float64

In [104]:
np.random.seed(100)
data2 = pd.DataFrame(np.random.randn(6, 4),
                    columns=['A', 'B', 'C', 'D'],
                    index=pd.date_range('20160701', periods=6))
data2

                   A         B         C         D
2016-07-01 -1.749765  0.342680  1.153036 -0.252436
2016-07-02  0.981321  0.514219  0.221180 -1.070043
2016-07-03 -0.189496  0.255001 -0.458027  0.435163
2016-07-04 -0.583595  0.816847  0.672721 -0.104411
2016-07-05 -0.531280  1.029733 -0.438136 -1.118318
2016-07-06  1.618982  1.541605 -0.251879 -0.842436

In [105]:
data2.corr()

          A         B         C         D
A  1.000000  0.570860 -0.558334 -0.434793
B  0.570860  1.000000 -0.358834 -0.564178
C -0.558334 -0.358834  1.000000  0.170589
D -0.434793 -0.564178  0.170589  1.000000

In [106]:
data2['A'].corr(data2['B'])

0.5708601734049654

In [107]:
data2.cov()

          A         B         C         D
A  1.454039  0.333822 -0.442664 -0.324590
B  0.333822  0.235177 -0.114415 -0.169386
C -0.442664 -0.114415  0.432298  0.069440
D -0.324590 -0.169386  0.069440  0.383292

In [108]:
data2['B'].cov(data2['C'])

-0.11441489518113819

In [109]:
data.std()

one    3.493685
two    2.255671
dtype: float64

In [110]:
print(data.var())

one    12.205833
two     5.088050
dtype: float64

In [111]:
print(data.min())
print(data.max(axis=1))
print(data.max(axis=0))

one    0.75
two   -4.50
dtype: float64
a    1.40
b    7.10
c     NaN
d    0.75
dtype: float64
one    7.10
two   -1.31
dtype: float64

In [112]:
print(data.idxmin())
print(data.idxmax(axis=1))
print(data.quantile())

one    d
two    b
dtype: object
a    one
b    one
c    NaN
d    one
dtype: object
one    1.400
two   -2.905
Name: 0.5, dtype: float64

In [113]:
print(data.cumsum())
print(data.cumprod())

    one   two
a  1.40   NaN
b  8.50 -4.50
c   NaN   NaN
d  9.25 -5.81
     one    two
a  1.400    NaN
b  9.940 -4.500
c    NaN    NaN
d  7.455  5.895

In [114]:
data[data>1].sum()

one    8.5
two    0.0
dtype: float64

In [116]:
dates = data2.index
random_dates = np.random.permutation(dates)
data2 = data2.reindex(index=random_dates, columns=['D', 'B', 'C', 'A'])

data2

                   D         B         C         A
2016-07-05 -1.118318  1.029733 -0.438136 -0.531280
2016-07-03  0.435163  0.255001 -0.458027 -0.189496
2016-07-02 -1.070043  0.514219  0.221180  0.981321
2016-07-04 -0.104411  0.816847  0.672721 -0.583595
2016-07-06 -0.842436  1.541605 -0.251879  1.618982
2016-07-01 -0.252436  0.342680  1.153036 -1.749765

In [117]:
data2.sort_index(axis=0)

                   D         B         C         A
2016-07-01 -0.252436  0.342680  1.153036 -1.749765
2016-07-02 -1.070043  0.514219  0.221180  0.981321
2016-07-03  0.435163  0.255001 -0.458027 -0.189496
2016-07-04 -0.104411  0.816847  0.672721 -0.583595
2016-07-05 -1.118318  1.029733 -0.438136 -0.531280
2016-07-06 -0.842436  1.541605 -0.251879  1.618982

In [118]:
data2.sort_index(axis=1)

                   A         B         C         D
2016-07-05 -0.531280  1.029733 -0.438136 -1.118318
2016-07-03 -0.189496  0.255001 -0.458027  0.435163
2016-07-02  0.981321  0.514219  0.221180 -1.070043
2016-07-04 -0.583595  0.816847  0.672721 -0.104411
2016-07-06  1.618982  1.541605 -0.251879 -0.842436
2016-07-01 -1.749765  0.342680  1.153036 -0.252436

In [119]:
data2.sort_index(axis=1, ascending=False)

                   D         C         B         A
2016-07-05 -1.118318 -0.438136  1.029733 -0.531280
2016-07-03  0.435163 -0.458027  0.255001 -0.189496
2016-07-02 -1.070043  0.221180  0.514219  0.981321
2016-07-04 -0.104411  0.672721  0.816847 -0.583595
2016-07-06 -0.842436 -0.251879  1.541605  1.618982
2016-07-01 -0.252436  1.153036  0.342680 -1.749765

In [120]:
data2.sort_values(by='D')

                   D         B         C         A
2016-07-05 -1.118318  1.029733 -0.438136 -0.531280
2016-07-02 -1.070043  0.514219  0.221180  0.981321
2016-07-06 -0.842436  1.541605 -0.251879  1.618982
2016-07-01 -0.252436  0.342680  1.153036 -1.749765
2016-07-04 -0.104411  0.816847  0.672721 -0.583595
2016-07-03  0.435163  0.255001 -0.458027 -0.189496

In [121]:
data2.sort_values(by='B', ascending=False)

                   D         B         C         A
2016-07-06 -0.842436  1.541605 -0.251879  1.618982
2016-07-05 -1.118318  1.029733 -0.438136 -0.531280
2016-07-04 -0.104411  0.816847  0.672721 -0.583595
2016-07-02 -1.070043  0.514219  0.221180  0.981321
2016-07-01 -0.252436  0.342680  1.153036 -1.749765
2016-07-03  0.435163  0.255001 -0.458027 -0.189496

In [122]:
data2['E'] = np.random.randint(0, 6, size=6)
data2['F'] = ['alpha', 'beta', 'gamma', 'gamma', 'alpha', 'gamma']

data2

                   D         B         C         A  E      F
2016-07-05 -1.118318  1.029733 -0.438136 -0.531280  2  alpha
2016-07-03  0.435163  0.255001 -0.458027 -0.189496  1   beta
2016-07-02 -1.070043  0.514219  0.221180  0.981321  5  gamma
2016-07-04 -0.104411  0.816847  0.672721 -0.583595  4  gamma
2016-07-06 -0.842436  1.541605 -0.251879  1.618982  2  alpha
2016-07-01 -0.252436  0.342680  1.153036 -1.749765  0  gamma

In [123]:
data2.sort_values(by=['E', 'F'])

                   D         B         C         A  E      F
2016-07-01 -0.252436  0.342680  1.153036 -1.749765  0  gamma
2016-07-03  0.435163  0.255001 -0.458027 -0.189496  1   beta
2016-07-05 -1.118318  1.029733 -0.438136 -0.531280  2  alpha
2016-07-06 -0.842436  1.541605 -0.251879  1.618982  2  alpha
2016-07-04 -0.104411  0.816847  0.672721 -0.583595  4  gamma
2016-07-02 -1.070043  0.514219  0.221180  0.981321  5  gamma

In [124]:
data2['F'].unique()

array(['alpha', 'beta', 'gamma'], dtype=object)

In [125]:
data2['F'].value_counts()

gamma    3
alpha    2
beta     1
Name: F, dtype: int64

In [126]:
data2.transpose()

  2016-07-05 2016-07-03 2016-07-02 2016-07-04 2016-07-06 2016-07-01
D   -1.11832   0.435163   -1.07004  -0.104411  -0.842436  -0.252436
B    1.02973   0.255001   0.514219   0.816847    1.54161    0.34268
C  -0.438136  -0.458027    0.22118   0.672721  -0.251879    1.15304
A   -0.53128  -0.189496   0.981321  -0.583595    1.61898   -1.74977
E          2          1          5          4          2          0
F      alpha       beta      gamma      gamma      alpha      gamma

In [127]:
data2.T()

TypeError: 'DataFrame' object is not callable

In [128]:
print(x)
print(y)

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11
    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [130]:
x2 = x.copy()
x2 += y
print(x2)
print(x+y)

      a     b     c     d
0   0.0   2.0   4.0   6.0
1   9.0  11.0  13.0  15.0
2  18.0  20.0  22.0  24.0
      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [131]:
x3 = x.copy()
x3 -= y
print(x3)
print(x-y)

     a    b    c    d
0  0.0  0.0  0.0  0.0
1 -1.0 -1.0 -1.0 -1.0
2 -2.0 -2.0 -2.0 -2.0
     a    b    c    d   e
0  0.0  0.0  0.0  0.0 NaN
1 -1.0 -1.0 -1.0 -1.0 NaN
2 -2.0 -2.0 -2.0 -2.0 NaN
3  NaN  NaN  NaN  NaN NaN

In [132]:
x4 = x.copy()
x4 *= y
print(x4)
print(x*y)

      a     b      c      d
0   0.0   1.0    4.0    9.0
1  20.0  30.0   42.0   56.0
2  80.0  99.0  120.0  143.0
      a     b      c      d   e
0   0.0   1.0    4.0    9.0 NaN
1  20.0  30.0   42.0   56.0 NaN
2  80.0  99.0  120.0  143.0 NaN
3   NaN   NaN    NaN    NaN NaN

In [134]:
x5 = x.copy()
x5 /= y
print(x5)
print(x/y)

     a         b         c         d
0  NaN  1.000000  1.000000  1.000000
1  0.8  0.833333  0.857143  0.875000
2  0.8  0.818182  0.833333  0.846154
     a         b         c         d   e
0  NaN  1.000000  1.000000  1.000000 NaN
1  0.8  0.833333  0.857143  0.875000 NaN
2  0.8  0.818182  0.833333  0.846154 NaN
3  NaN       NaN       NaN       NaN NaN

In [135]:
x6 = x.copy()
x6 //= y
print(x6)
print(x6//y)

     a    b    c    d
0  NaN  1.0  1.0  1.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
     a    b    c    d   e
0  NaN  1.0  0.0  0.0 NaN
1  0.0  0.0  0.0  0.0 NaN
2  0.0  0.0  0.0  0.0 NaN
3  NaN  NaN  NaN  NaN NaN

In [136]:
x7 = x.copy()
x7 %= y
print(x7)
print(x%y)

     a    b     c     d
0  NaN  0.0   0.0   0.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0
     a    b     c     d   e
0  NaN  0.0   0.0   0.0 NaN
1  4.0  5.0   6.0   7.0 NaN
2  8.0  9.0  10.0  11.0 NaN
3  NaN  NaN   NaN   NaN NaN

In [137]:
x8 = x.copy()
x8 **= y
print(x8)
print(x**y)

              a             b             c             d
0  1.000000e+00  1.000000e+00  4.000000e+00  2.700000e+01
1  1.024000e+03  1.562500e+04  2.799360e+05  5.764801e+06
2  1.073742e+09  3.138106e+10  1.000000e+12  3.452271e+13
              a             b             c             d   e
0  1.000000e+00  1.000000e+00  4.000000e+00  2.700000e+01 NaN
1  1.024000e+03  1.562500e+04  2.799360e+05  5.764801e+06 NaN
2  1.073742e+09  3.138106e+10  1.000000e+12  3.452271e+13 NaN
3           NaN           NaN           NaN           NaN NaN